## generate_sbom
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                         NAME                         |
|--------|------------------------------------------------------|
| add    | `aws_ecrpublic_repository.generate_sbom_public`      |
|        | `aws_ecrpublic_repository_policy.sbom_public_policy` |
| delete | `aws_ecr_repository.generate_sbom`                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ecr_repository.generate_sbom will be destroyed
  # (because aws_ecr_repository.generate_sbom is not in configuration)
  - resource "aws_ecr_repository" "generate_sbom" {
      - arn                  = "arn:aws:ecr:ca-central-1:794722365809:repository/security-tools/generate_sbom/trivy" -> null
      - id                   = "security-tools/generate_sbom/trivy" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "security-tools/generate_sbom/trivy" -> null
      - registry_id          = "794722365809" -> null
      - repository_url       = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/generate_sbom/trivy" -> null
      - tags                 = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-generate_sbom"
          - "Terraform"  = "true"
        } -> null
      - tags_all             = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-generate_sbom"
          - "Terraform"  = "true"
        } -> null

      - encryption_configuration {
          - encryption_type = "KMS" -> null
          - kms_key         = "arn:aws:kms:ca-central-1:794722365809:key/465381ce-855c-4f13-b1d9-427f1ddee696" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # aws_ecrpublic_repository.generate_sbom_public will be created
  + resource "aws_ecrpublic_repository" "generate_sbom_public" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + registry_id     = (known after apply)
      + repository_name = "security-tools/generate_sbom/trivy"
      + repository_uri  = (known after apply)
      + tags            = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-generate_sbom"
          + "Terraform"  = "true"
        }
      + tags_all        = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-generate_sbom"
          + "Terraform"  = "true"
        }
    }

  # aws_ecrpublic_repository_policy.sbom_public_policy will be created
  + resource "aws_ecrpublic_repository_policy" "sbom_public_policy" {
      + id              = (known after apply)
      + policy          = (sensitive)
      + registry_id     = (known after apply)
      + repository_name = "security-tools/generate_sbom/trivy"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
